In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt
import seaborn as sns

# Data Preprocessing

For Data Preprocessing here we are using Social_Network_Ads_1 Data Set. It is talking about the customers information. A particular company is displaying lots of ads to the customers through social media(Company is trying to show ads only the customers who purchased the product) . What is our task is , Here we have a particular variable $ purchased $. It is our target variable . Here based on various other information(Country,Gender,Salary etc..). Here we are trying to estimate whether he is purchased the product or not or ideally is there is any chance that a particular customer purchases the product

In [2]:
data = pd.read_csv(r"Social_Network_Ads_1.csv")

In [3]:
data

      User ID        Date   Country  Gender  Age  EstimatedSalary  Purchased
0    15624510  01-03-2012    France    Male   19          19000.0          0
1    15810944  01-04-2012     Italy    Male   35          20000.0          0
2    15668575  01-05-2012    France  Female   26          43000.0          0
3    15603246  01-06-2012   Germany  Female   27          57000.0          0
4    15804002  01-09-2012    France    Male   19          76000.0          0
..        ...         ...       ...     ...  ...              ...        ...
398  15691863  08-05-2013    France  Female   46          41000.0          1
399  15706071  08-06-2013     Italy    Male   51          23000.0          1
400  15654296  08-07-2013     Italy  Female   50          20000.0          1
401  15755018  08-08-2013   Germany    Male   36          33000.0          0
402  15594041  08-09-2013  Germany&  Female   49          36000.0          1

[403 rows x 7 columns]

In [4]:
data.shape

(403, 7)

## Checking for any missing values

What ? --> What is the missing value

Why ? ---> Why do we need to handle this

Example -: Let's assume that our data is --> 200,400,nan,500,750

So we know that our machine learning model is a mathematical model. Let's assume that our machine is doing something like this,

200+400+nan+500+750 -> Is this valid ? No. We can't add nan value with numbers

ie, we can't use nan value for calculations in a machine learning model
   

How ? How to handle the missing value 

Either fill the missing value

    --- 1. Fill With mean or median or mode
    
    ----2. Fill by analyzing the data
    
           -----2.1 GroupBy Analysis
           
           -----2.2 Stats analysis
           
    ----3. Fill with random selection in the variable
    
    ----4. Fill with some relevant value
    
    ----5. Predict the missing value
           

OR drop the missing value

    ---- 1. Drop a row ( When you have a huge data set)
    
    ---- 2. Drop the entire column (When there is 30%-40% of missing values in the column)

In [5]:
data.isnull().any()

User ID            False
Date               False
Country            False
Gender             False
Age                False
EstimatedSalary     True
Purchased          False
dtype: bool

In [6]:
data.isnull().any().sum() # Gives the number of columns with missing values

1

In [7]:
data.isnull().sum()

User ID            0
Date               0
Country            0
Gender             0
Age                0
EstimatedSalary    2
Purchased          0
dtype: int64

In [8]:
data["EstimatedSalary"].isnull().sum()

2

# Handling Missing Values

### Filling with mean or median

In [9]:
data.mean(numeric_only=True)

User ID            1.569141e+07
Age                3.769231e+01
EstimatedSalary    8.236658e+04
Purchased          3.598015e-01
dtype: float64

In [10]:
data["EstimatedSalary"].mean()

82366.58354114713

In [11]:
data.fillna(data["EstimatedSalary"].mean()).isnull().any() # To get the data get updated use inplace=True

User ID            False
Date               False
Country            False
Gender             False
Age                False
EstimatedSalary    False
Purchased          False
dtype: bool

In [12]:
data["EstimatedSalary"].median()

70000.0

Here we can see that mean is 82K+ and median is 70K  Big difference between mean and median which means, our mean value is got affected by outliers . Mean is greater than median which means on the right side we have outliers. In this we can go for median

In [13]:
data.fillna(data["EstimatedSalary"].median())

      User ID        Date   Country  Gender  Age  EstimatedSalary  Purchased
0    15624510  01-03-2012    France    Male   19          19000.0          0
1    15810944  01-04-2012     Italy    Male   35          20000.0          0
2    15668575  01-05-2012    France  Female   26          43000.0          0
3    15603246  01-06-2012   Germany  Female   27          57000.0          0
4    15804002  01-09-2012    France    Male   19          76000.0          0
..        ...         ...       ...     ...  ...              ...        ...
398  15691863  08-05-2013    France  Female   46          41000.0          1
399  15706071  08-06-2013     Italy    Male   51          23000.0          1
400  15654296  08-07-2013     Italy  Female   50          20000.0          1
401  15755018  08-08-2013   Germany    Male   36          33000.0          0
402  15594041  08-09-2013  Germany&  Female   49          36000.0          1

[403 rows x 7 columns]

## Mode

Mode is used to fill categorical data because mean and median can't be used with categorical data . It gives the most occurring value

In [14]:
data["EstimatedSalary"].mode()

0    72000.0
dtype: float64

It gives data in series format so in order to get the mode value we need ti slice it

In [15]:
data["EstimatedSalary"].mode()[0]

72000.0

In [16]:
data["EstimatedSalary"].fillna(data["EstimatedSalary"].mode()[0]).isnull().sum() # For updating the data frame use inplace=True

0

While filling with mean and median we used data.fillna(). But while filling with median we have to use data[Column_Name].fillna()

## bfill() and ffill()

bfill -> Backward Fill

ffill -> Forward Fill

Whenever the data is depends on time, ie. when the previous data(row) is depends on the current data(row). and wen there is a NaN(Missing) Value we can fill with the previous row value(ffill) or next row value(bfill)

In [17]:
data[data.isnull().any(axis=1)] # Shows the rows where we have mising values

      User ID       Date Country  Gender  Age  EstimatedSalary  Purchased
10   15570769  1/18/2012   Italy  Female   26              NaN          0
167  15762228  8/30/2012  France  Female   22              NaN          0

In [18]:
data.iloc[8:15]

     User ID       Date  Country  Gender  Age  EstimatedSalary  Purchased
8   15600575  1/13/2012    Italy    Male   25          33000.0          0
9   15727311  1/17/2012  Germany  Female   35          65000.0          0
10  15570769  1/18/2012    Italy  Female   26              NaN          0
11  15606274  1/19/2012   France  Female   26          52000.0          0
12  15746139  1/20/2012    Italy    Male   20          86000.0          0
13  15704987  1/23/2012   France    Male   32          18000.0          0
14  15628972  1/24/2012   France    Male   18          82000.0          0

In [19]:
data.bfill().iloc[8:15] # Missing data was [10][Estimated Salary] filled with next row value

     User ID       Date  Country  Gender  Age  EstimatedSalary  Purchased
8   15600575  1/13/2012    Italy    Male   25          33000.0          0
9   15727311  1/17/2012  Germany  Female   35          65000.0          0
10  15570769  1/18/2012    Italy  Female   26          52000.0          0
11  15606274  1/19/2012   France  Female   26          52000.0          0
12  15746139  1/20/2012    Italy    Male   20          86000.0          0
13  15704987  1/23/2012   France    Male   32          18000.0          0
14  15628972  1/24/2012   France    Male   18          82000.0          0

In [20]:
data.ffill().iloc[8:15] # Missing data was [10][Estimated Salary] filled with previous row value

     User ID       Date  Country  Gender  Age  EstimatedSalary  Purchased
8   15600575  1/13/2012    Italy    Male   25          33000.0          0
9   15727311  1/17/2012  Germany  Female   35          65000.0          0
10  15570769  1/18/2012    Italy  Female   26          65000.0          0
11  15606274  1/19/2012   France  Female   26          52000.0          0
12  15746139  1/20/2012    Italy    Male   20          86000.0          0
13  15704987  1/23/2012   France    Male   32          18000.0          0
14  15628972  1/24/2012   France    Male   18          82000.0          0

## GroupBy

In [21]:
data[data.isnull().any(axis=1)] # Missing values

      User ID       Date Country  Gender  Age  EstimatedSalary  Purchased
10   15570769  1/18/2012   Italy  Female   26              NaN          0
167  15762228  8/30/2012  France  Female   22              NaN          0

While using the statistic(Mean , Median or Mode) to fill missing value , We are filling all the missing values with the same value

The first customer whose salary is missing is from Italy and the second customer whose salary is missing is from France. Instead of randomly filling these values with mean or median . We can fill the missing value of Italy Customers with the mean of Italy Customers and same with France Customers

In [23]:
gp_c = data.groupby("Country")

In [24]:
gp_c

In [25]:
gp_c.groups # To see the groups

{'France': [0, 2, 4, 6, 11, 13, 14, 16, 23, 24, 26, 32, 33, 37, 38, 42, 43, 56, 59, 60, 63, 66, 68, 71, 72, 79, 80, 81, 83, 89, 98, 100, 104, 105, 107, 108, 109, 121, 123, 125, 128, 129, 130, 132, 133, 134, 136, 137, 140, 143, 144, 147, 149, 152, 153, 161, 164, 167, 169, 170, 174, 176, 177, 178, 183, 186, 187, 190, 198, 202, 208, 209, 211, 214, 216, 217, 224, 226, 239, 240, 241, 253, 255, 256, 259, 271, 272, 280, 282, 285, 291, 301, 302, 304, 305, 306, 308, 309, 311, 316, ...], 'Germany': [3, 9, 15, 17, 18, 20, 21, 28, 31, 34, 39, 45, 46, 47, 54, 57, 62, 64, 70, 73, 75, 78, 82, 84, 85, 87, 90, 93, 95, 101, 106, 110, 114, 115, 116, 117, 118, 120, 127, 138, 142, 146, 148, 154, 155, 158, 159, 160, 162, 165, 172, 180, 181, 182, 184, 191, 192, 196, 199, 200, 201, 203, 204, 205, 218, 220, 221, 222, 223, 225, 231, 232, 236, 238, 246, 247, 251, 254, 257, 261, 262, 265, 267, 268, 273, 274, 275, 276, 277, 278, 279, 286, 288, 289, 292, 293, 294, 295, 299, 307, ...], 'Germany&': [402], 'Italy': [1, 5, 7, 8, 10, 12, 19, 22, 25, 27, 29, 30, 35, 36, 40, 41, 44, 48, 49, 50, 51, 52, 53, 55, 58, 61, 65, 67, 69, 74, 76, 77, 86, 88, 91, 92, 94, 96, 97, 99, 102, 103, 111, 112, 113, 119, 122, 124, 126, 131, 135, 139, 141, 145, 150, 151, 156, 157, 163, 166, 168, 171, 173, 175, 179, 185, 188, 189, 193, 194, 195, 197, 206, 207, 210, 212, 213, 215, 219, 227, 228, 229, 230, 233, 234, 235, 237, 242, 243, 244, 245, 248, 249, 250, 252, 258, 260, 263, 264, 266, ...], ']Germany&': [389], ']Italy&': [360, 361]}

In [26]:
gp_c.mean()

                User ID        Age  EstimatedSalary  Purchased
Country
France     1.569176e+07  36.460317    107072.000000   0.309524
Germany    1.569432e+07  38.825758     71484.848485   0.431818
Germany&   1.559404e+07  49.000000     36000.000000   1.000000
Italy      1.568981e+07  37.531915     71364.285714   0.326241
]Germany&  1.572415e+07  49.000000     39000.000000   1.000000
]Italy&    1.562266e+07  40.500000     71500.000000   0.500000

In [30]:
gp_c.mean()['EstimatedSalary']

Country
France       107072.000000
Germany       71484.848485
Germany&      36000.000000
Italy         71364.285714
]Germany&     39000.000000
]Italy&       71500.000000
Name: EstimatedSalary, dtype: float64

In [31]:
gp_c.mean()['EstimatedSalary']['Italy'] #Mean Salary Of Italy Customers

71364.28571428571

In [32]:
gp_c.mean()['EstimatedSalary']['France']  #Mean Salary Of Italy Customers

107072.0

In [33]:
missing_values = data[data.isnull().any(axis=1)]  # Missing values

In [50]:
for idx,row in missing_values.iterrows():
    c_customer = row["Country"]
    mean_sal = gp_c.mean()['EstimatedSalary'][c_customer] 
    data.loc[idx,"EstimatedSalary"] = mean_sal

In [56]:
data[data.isnull().any(axis=1)]

Empty DataFrame
Columns: [User ID, Date, Country, Gender, Age, EstimatedSalary, Purchased]
Index: []

In [65]:
data.groupby(by=["Gender","Country"]).mean() # Grouping with multiple columns

                       User ID        Age  EstimatedSalary  Purchased
Gender Country
Female France     1.568355e+07  36.842105     70720.561404   0.280702
       Germany    1.570076e+07  39.638889     73208.333333   0.486111
       Germany&   1.559404e+07  49.000000     36000.000000   1.000000
       Italy      1.569373e+07  38.315068     74881.702544   0.342466
       ]Germany&  1.572415e+07  49.000000     39000.000000   1.000000
       ]Italy&    1.567139e+07  41.000000     72000.000000   0.000000
Male   France     1.569853e+07  36.144928    137101.449275   0.333333
       Germany    1.568660e+07  37.850000     69416.666667   0.366667
       Italy      1.568560e+07  36.691176     67588.235294   0.308824
       ]Italy&    1.557393e+07  40.000000     71000.000000   1.000000

In [69]:
data.groupby(by=["Gender","Country"]).mean().loc["Female"] # Mean salary of males in every country

                User ID        Age  EstimatedSalary  Purchased
Country
France     1.568355e+07  36.842105     70720.561404   0.280702
Germany    1.570076e+07  39.638889     73208.333333   0.486111
Germany&   1.559404e+07  49.000000     36000.000000   1.000000
Italy      1.569373e+07  38.315068     74881.702544   0.342466
]Germany&  1.572415e+07  49.000000     39000.000000   1.000000
]Italy&    1.567139e+07  41.000000     72000.000000   0.000000

In [70]:
data.groupby(by=["Gender","Country"]).mean().loc["Male"]

              User ID        Age  EstimatedSalary  Purchased
Country
France   1.569853e+07  36.144928    137101.449275   0.333333
Germany  1.568660e+07  37.850000     69416.666667   0.366667
Italy    1.568560e+07  36.691176     67588.235294   0.308824
]Italy&  1.557393e+07  40.000000     71000.000000   1.000000

In [72]:
data.groupby(by=["Gender","Country"]).mean().loc["Male"].loc["France"]

User ID            1.569853e+07
Age                3.614493e+01
EstimatedSalary    1.371014e+05
Purchased          3.333333e-01
Name: France, dtype: float64

In [73]:
data.groupby(by=["Gender","Country"]).mean().loc["Male"].loc["France","EstimatedSalary"]

137101.4492753623

## Fill with random value

In [74]:
import random

In [77]:
random.choice(data["EstimatedSalary"]) # Randomly Choosing One Value From the estimated salary

18000.0

In [81]:
random.choices(data["EstimatedSalary"],k=4) # Choose K values

[58000.0, 72000.0, 134000.0, 63000.0]

In [83]:
data["EstimatedSalary"].fillna(random.choice(data["EstimatedSalary"]))

0      19000.0
1      20000.0
2      43000.0
3      57000.0
4      76000.0
        ...
398    41000.0
399    23000.0
400    20000.0
401    33000.0
402    36000.0
Name: EstimatedSalary, Length: 403, dtype: float64

In [86]:
data["EstimatedSalary"].sample() # Returns a random sample  from the data

294    89000.0
Name: EstimatedSalary, dtype: float64

In [88]:
data["EstimatedSalary"].sample(n=10) # Returns n random samples from the data

36      28000.0
296     77000.0
290    138000.0
49      89000.0
72      23000.0
13      18000.0
153     50000.0
314     96000.0
302    117000.0
223     91000.0
Name: EstimatedSalary, dtype: float64

## Drop Missing Value

Drop missing value only if we have more amount of information and less amount of missing values(Droping the entire row)

In [92]:
data = pd.read_csv(r"Social_Network_Ads_1.csv")
data[data.isnull().any(axis=1)]

      User ID       Date Country  Gender  Age  EstimatedSalary  Purchased
10   15570769  1/18/2012   Italy  Female   26              NaN          0
167  15762228  8/30/2012  France  Female   22              NaN          0

In [95]:
data.dropna(inplace=True) # Dropped Rows with missign values

In [96]:
data[data.isnull().any(axis=1)]

Empty DataFrame
Columns: [User ID, Date, Country, Gender, Age, EstimatedSalary, Purchased]
Index: []

In [97]:
data.head(20)

     User ID        Date  Country  Gender  Age  EstimatedSalary  Purchased
0   15624510  01-03-2012   France    Male   19          19000.0          0
1   15810944  01-04-2012    Italy    Male   35          20000.0          0
2   15668575  01-05-2012   France  Female   26          43000.0          0
3   15603246  01-06-2012  Germany  Female   27          57000.0          0
4   15804002  01-09-2012   France    Male   19          76000.0          0
5   15728773  01-10-2012    Italy    Male   27          58000.0          0
6   15598044  01-11-2012   France  Female   27          84000.0          0
7   15694829  01-12-2012    Italy  Female   32         150000.0          1
8   15600575   1/13/2012    Italy    Male   25          33000.0          0
9   15727311   1/17/2012  Germany  Female   35          65000.0          0
11  15606274   1/19/2012   France  Female   26          52000.0          0
12  15746139   1/20/2012    Italy    Male   20          86000.0          0
13  15704987   1/23/2012   France    Male   32          18000.0          0
14  15628972   1/24/2012   France    Male   18          82000.0          0
15  15697686   1/25/2012  Germany    Male   29          80000.0          0
16  15733883   1/26/2012   France    Male   47          25000.0          1
17  15617482   1/27/2012  Germany    Male   45          26000.0          1
18  15704583   1/30/2012  Germany    Male   46          28000.0          1
19  15621083   1/31/2012    Italy  Female   48          29000.0          1
20  15649487  02-01-2012  Germany    Male   45          22000.0          1

Now the Index is not in order(11th after 9th) because we have deleted some rows .So what we can change the index like

In [100]:
data.reset_index(drop=True,inplace=True)

In [102]:
data.iloc[10]

User ID             15606274
Date               1/19/2012
Country               France
Gender                Female
Age                       26
EstimatedSalary      52000.0
Purchased                  0
Name: 10, dtype: object

### Droping a Column

When we have a column with 25% - 30% missing values, We can drop that column

In [103]:
data.drop("EstimatedSalary",axis=1)

      User ID        Date   Country  Gender  Age  Purchased
0    15624510  01-03-2012    France    Male   19          0
1    15810944  01-04-2012     Italy    Male   35          0
2    15668575  01-05-2012    France  Female   26          0
3    15603246  01-06-2012   Germany  Female   27          0
4    15804002  01-09-2012    France    Male   19          0
..        ...         ...       ...     ...  ...        ...
396  15691863  08-05-2013    France  Female   46          1
397  15706071  08-06-2013     Italy    Male   51          1
398  15654296  08-07-2013     Italy  Female   50          1
399  15755018  08-08-2013   Germany    Male   36          0
400  15594041  08-09-2013  Germany&  Female   49          1

[401 rows x 6 columns]